<?php

/* @var $this yii\web\View */

$this->title = 'Личный кабинет';
?>
<div class="site-index">

    <h1>Личный кабинет</h1>

    <div class="body-content">

        <div class="row">

            <p>
                Иванов Иван Иванович
                <br/>
                18.10.1980
                <br/>
                Мужчина
            </p>

            <p>
                Абонемент активен до 30.04.2017
            </p>

            <p>
                Занятий в тренажерном зале: осталось / приобретено
                <br/>
                Занятий в групповом зале: осталось / приобретено
                <br/>
                Персональных тренировок: осталось / приобретено
            </p>

            <p>
                Заморозка карты: отключено / заморожено до дд.мм.ггг
            </p>

            <p>
                Список активных опций:
            </p>
            <ul>
                <li>
                    - опция
                </li>
                <li>
                    - опция
                </li>
                <li>
                    ...
                </li>
            </ul>

            <p><a class="btn btn-default" href="/">Оставить заявку на обратный звонок &raquo;</a></p>
        </div>
        
    </div>
</div>
