<?php

/* @var $this yii\web\View */

$this->title = 'My Yii Application';
?>
<div class="site-index">

    <div class="jumbotron">
        <h1>Congratulations!</h1>

        <p class="lead">You have successfully created your Yii-powered application.</p>

        <p><a class="btn btn-lg btn-success" href="http://www.yiiframework.com">Get started with Yii</a></p>
    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-4">
                <h2>Heading</h2>

                <p>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et
                    dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip
                    ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu
                    fugiat nulla pariatur.</p>

                <p><a class="btn btn-default" href="http://www.yiiframework.com/doc/">Yii Documentation &raquo;</a></p>
            </div>
            <div class="col-lg-4">
                <h2>Heading</h2>

                <p>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et
                    dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip
                    ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu
                    fugiat nulla pariatur.</p>

                <p><a class="btn btn-default" href="http://www.yiiframework.com/forum/">Yii Forum &raquo;</a></p>
            </div>
            <div class="col-lg-4">
                <h2>Heading</h2>

                <p>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et
                    dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip
                    ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu
                    fugiat nulla pariatur.</p>

                <p><a class="btn btn-default" href="http://www.yiiframework.com/extensions/">Yii Extensions &raquo;</a></p>
            </div>
        </div>

    </div>
</div>



<style>
    #kakkak td {
        vertical-align: top;
    }
    #kakkak td[colspan="3"] {
        text-align: center;
        font-size: 1.6em;
    }
</style>
<table id="kakkak">
    <thead>
        <tr>
            <th>14 - 25 лет</th>
            <th>25 - 45 лет</th>
            <th>45 лет</th>
        </tr>
    </thead>
    <tbody>
        <tr>
            <td>
                <p>эффективнее готовиться к экзаменам
                <p> ---
                <p>внятно выражать свои мысли

            </td>
            <td>
                <p>Эффективность на работе
                <p> ---
                <p> ---
                <p>быстрее осваивать новые навыки
            </td>
            <td>
                <p>Повышение вниательности (будете помнить куда положили свои очки)
                <p>Избавиться от забывчивости
            </td>
        </tr>
        <tr>
            <td colspan="3">Измеримый эффект</td>
        </tr>
        <tr>
            <td colspan="3">
                <p>Ускорение скорости чтения в 3 раза и более
                <p>Увеличение запоминаемости на 40% и более
            </td>
        </tr>
    </tbody>
</table>




<h1 style="text-align: center;"><span style="color:#282830; font-family:open sans,sans-serif;"><strong><span style="font-size:48px;">&nbsp;ПРАКТИЧЕСКИЙ ONLINE КУРС<br />&quot;SUPERпамять и&nbsp;Скорочтение&quot;</span></strong></span></h1>




<ol>
    <li><span style="font-size:18px;"><span style="font-size: 18px;"><font color="#ff8c00" face="verdana, geneva, sans-serif"><b>+ [тетрадка, ручка, ноутбук] Курс на 80% состоит из практики - для гарантированного эффекта</b></font></span></span></li>
    <li><span style="font-size:18px;">​+ [Человек, в руках у него книга и телефон]&nbsp;<font color="#ff8c00" face="verdana, geneva, sans-serif"><b>Есть кураторы &mdash; в любой момент могут ответить на ваши вопросы.</b></font></span></li>
    <li><span style="font-size:18px;">+ [Человек с тремя листочками с цифрми 80-120-140 / без человека] 3 тестирования за курс &mdash; до, в процессе и после обучения</span></li>
<li><span style="font-size:18px;"><font color="#ff8c00" face="verdana, geneva, sans-serif"><b>+ [Будильник-ноутбук / человек сидящий за ноутбуком с будильником] Вы можете выбрать удобное для вас время прохождения курса.&nbsp;<span style="font-size:18px;"><font color="#ff8c00" face="verdana, geneva, sans-serif"><b>Всего 20 занятий </b></font><b style="color: rgb(255, 140, 0); font-family: verdana, geneva, sans-serif; font-size: 26px;">&mdash;</b><font color="#ff8c00" face="verdana, geneva, sans-serif"><b> 10 по скорочтению и 10 по памяти, которые идут дпараллельно.&nbsp;<span style="font-size:18px;"><b style="color: rgb(255, 140, 0); font-family: verdana, geneva, sans-serif; font-size: 12.0012px;">Оптимильное продолжительность занятия - 90 минут.</b></span></b></font></span></b></font></span></li>
</ol>
<span style="font-size:18px;"><b style="color: rgb(255, 140, 0); font-family: verdana, geneva, sans-serif; font-size: 12.0012px;"><b style="color: rgb(255, 140, 0); font-family: verdana, geneva, sans-serif; font-size: 12.0012px;">5. [Фото раздаточного материала / фото материала в руках у челвоека] Для прохождения курса используется раздаточный материал.<br />
6. [картинка &quot;Скорочтение школа Васильевых&quot;] Эффект от курса не теряется со временем - мы будем высылать вам домашнее задание в течение года</b></b></span>


<ol style="color:#242426; font-family:open sans,sans-serif; font-size: 20px;">
    <li>Курс на 80% состоит из практики - для гарантированного эффекта</li>
    <li>Есть кураторы — в любой момент могут ответить на ваши вопросы</li>
    <li>3 тестирования за курс — до, в процессе и после обучения</li>
    <li>Вы можете выбрать удобное для вас время прохождения курса. Всего 20 занятий — 10 по скорочтению и 10 по памяти, которые идут дпараллельно. Оптимальное продолжительность занятия - 90 минут.</li>
    <li>Для прохождения курса используется раздаточный материал — мы можем отправить вам его почтой</li>
    <li>Эффект от курса не теряется со временем - мы будем высылать вам домашнее задание в течение года</li>
</ol>


<p style="text-align: center;"><span style="color:#242426;"><span style="font-size:48px;"><span style="font-family:open sans,sans-serif;"><strong>КОНТАКТЫ</strong></span></span></span></p>


<script>
function openHiddenText() {
    document.getElementById('openTextLink').style.display = 'none';
    document.getElementById('mnogotochie').style.display = 'none';
    document.getElementById('textToShow').style.display = 'block';
    document.getElementById('block-new131').style.height = "1500px";
}
</script>

<div style="line-height: 1.35;">
    <font color="#696969" face="open sans" size="4">1)	Перекодировать слова-названия в образы за 1-2 с (Авторская методика Екатерины Васильевой)
<br />2)	Перекодировать слова-значения в образы за 1-2 с (Авторская методика Екатерины Васильевой)
<br />3)	Перекодировать однозначные числа в образы за 1-2 с
<br />4)	Перекодировать двузначные числа в образы за 1-2 с
<br />5)	Перекодировать трехзначные числа в образы за 1-2 с<span id="mnogotochie"><br />...<br /></span><span 
    id="textToShow" style="display: none;">6)	Перекодировать символы в образы за 1-2 с (Авторская методика Екатерины Васильевой)
<br />7)	Перекодировать иероглифы в образы за 1-2 с (Авторская методика Екатерины Васильевой)
<br />8)	Создать качественное соединение образов в 3 шага (Авторская методика Екатерины Васильевой)
<br />9)	Соединять два образа («парочку») в движении за 15 с (Авторская методика Екатерины Васильевой)
<br />10)	Соединять два образа («парочку») без движения за 6 с (Авторская методика Екатерины Васильевой)
<br />11)	Соединять три образа («троечку») в движении за 30 с (Авторская методика Екатерины Васильевой)
<br />12)	Соединять три образа («троечку») без движения за 12 с (Авторская методика Екатерины Васильевой)
<br />13)	Соединять четыре образа и более («горизонталь») методом «Цепочка»
<br />14)	Соединять четыре образа и более («горизонталь») методом «Рассказ» (Авторская методика Екатерины Васильевой)
<br />15)	Соединять четыре образа и более («горизонталь») методом «Бинокль»
<br />16)	Соединять четыре образа и более («вертикаль») методом «Цицерона»
<br />17)	Соединять четыре образа и более («вертикаль») методом «Крючков» (Авторская методика Екатерины Васильевой)
<br />18)	Соединять четыре образа и более («вертикаль») методом «Алфавит» (Авторская методика Екатерины Васильевой)
<br />19)	Разделить информацию на 4 вида последовательностей. (Авторская методика Екатерины Васильевой)
<br />20)	Запоминать последовательность 50-100 слов
<br />21)	Запоминать последовательность 50-100 чисел
<br />22)	Запоминать последовательность 100 иностранных слов за 30 минут (Авторская методика Екатерины Васильевой)
<br />23)	Запоминать иностранные слова 5 языков: английского, немецкого, испанского, итальянского, французского (Авторская методика Екатерины Васильевой)
<br />24)	Сжимать текст до 30% («Алгоритм абзаца») (Авторская методика Екатерины Васильевой)
<br />25)	Выделять «Главные мысли» в тексте (Авторская методика Екатерины Васильевой)
<br />26)	Формировать «Ключ к тексту» и пересказывать текст по нему (Авторская методика Екатерины Васильевой)
<br />27)	Сжимать текст до 10% («Карта текста») (Авторская методика Екатерины Васильевой)
<br />28)	Изобразить текст в виде интеллект-карты по законам логики (Авторская методика Екатерины Васильевой)
<br />29)	Выявлять в тексте причинно-следственные связи по законам «Теории текста» (Авторская методика Екатерины Васильевой)
<br />30)	Применять на практике законы «Логики» (Авторская методика Екатерины Васильевой)
<br />31)	Сжимать текст до 1% («Системная матрица») (Авторская методика Екатерины Васильевой)
<br />32)	Сформулировать определение к любому термину в тексте (Авторская методика Екатерины Васильевой)
<br />33)	Образно группировать текст (“Картинка”) (Авторская методика Екатерины Васильевой)
<br />34)	«Упаковывать» текст в «картинки» (“Путешествие”) (Авторская методика Екатерины Васильевой)
<br />35)	Запоминать длинные тексты 
<br />36)	Правильно изображать информацию, которая дана в тексте (“Художник”) (Авторская методика Екатерины Васильевой)
<br />37)	Запоминать энциклопедические тексты и другие сложные тексты, содержащие много точной информации (“Мнемонические методы”) (Авторская методика Екатерины Васильевой)
<br />38)	Запоминать определения тремя способами (“Мнемонические методы”)
<br />39)	Запоминать тексты большого объема: книги, учебники, доклады и т.п. (“Структурные методы”) (Авторская методика Екатерины Васильевой)
<br />40)	Понимать и запоминать трудные для вас тексты, в которых 80-90% новой информации (“Поэтапные методы”) (Авторская методика Екатерины Васильевой)
<br />41)	Запоминать любую информацию «Универсальной техникой запоминания», комбинируя 4 вида последовательностей (Авторская методика Екатерины Васильевой)
<br />42)	Знаете «Таблицу Менделеева», запомнив ее с помощью Универсальной техники запоминания (Авторская методика Екатерины Васильевой)
<br />43)	Запоминать ФИО тремя способами (Авторская методика Екатерины Васильевой)
<br />44)	Запоминать телефоны 
<br />45)	Запоминать исторические даты четырьмя способами (Авторская методика Екатерины Васильевой)
<br />46)	Запоминать стихи и прозу (Авторская методика Екатерины Васильевой)
<br />47)	Комбинировать “Логические методы” с “Образными методами запоминания текстов” (Авторская методика Екатерины Васильевой) 
<br />48)	Знаете 15 ошибок традиционного чтения и можете их исправить (Авторская методика Екатерины Васильевой)
<br />49)	Заменить ограничивающие убеждения относительно процесса чтения на позитивные (Авторская методика Екатерины Васильевой) 
<br />50)	Правильно психологически подготовиться к процессу чтения (Авторская методика Екатерины Васильевой)
<br />51)	Мгновенно создавать состояние “скоростного режима чтения”
<br />52)	Физиологически подготовиться и правильно дышать в процессе чтения (Авторская методика Екатерины Васильевой)
<br />53)	Глазами правильно двигать по тексту без возвратных движений 
<br />54)	Глазами вертикально-горизонтально двигать по тексту 
<br />55)	Расширить поле зрения 
<br />56)	Делать 2-3 фиксации взгляда на странице с частотой выше 120 ударов в минуту (Авторская методика Екатерины Васильевой)
<br />57)	Ускорить считывание слов и чисел, используя технику тахистоскопа 
<br />58)	Управлять своим вниманием в процессе чтения и развить все виды внимания
<br />59)	Избавиться от вокализации
<br />60)	Оттеснить проговаривание в процессе чтения
<br />61)	Управлять своей скоростью чтения в трех режимах (Авторская методика Екатерины Васильевой)
<br />62)	Читать алгоритмически (“Алгоритм абзаца”), выделяя только самое важное и сжимая текст до 30% (Авторская методика Екатерины Васильевой)
<br />63)	В процессе алгоритмического чтения представлять прочитанное, образно группируя его методом “Картинка” (Авторская методика Екатерины Васильевой)
<br />64)	Сформулировать Главную мысль текста (Авторская методика Екатерины Васильевой)
<br />65)	Пересказать текст по законам логики, используя “Системную матрицу” (Авторская методика Екатерины Васильевой)
<br />66)	Читать книги просмотровым чтением (Авторская методика Екатерины Васильевой)
<br />67)	Удерживать причинно-следственную связь в процессе чтения и развивать смысловую догадку (Авторская методика Екатерины Васильевой)
<br />68)	Скорость чтения 2500 знаков в минуту 
<br />69)	Коэффициент понимания 70-95%
<br />70)	Скорость просмотрового чтения - 1 страница за 2 секунды 

</span>
<a id="openTextLink" href="js:" onclick="openHiddenText()">Посмотреть все методы</a></font></div>
