<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'Отчеты о тренировках';
//$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <div class="row">
        <h2>
            20.03.2017	
        </h2>
        <p>
            Тренировка в групповом зале, осталось 3 тренировки до 30.03.17		
        </p>
        <p>
            Тренировка в тренажерном зале, тренировок больше не осталось.	
        </p>
    </div>

    <div class="row">
        <h2>
            18.03.2017	
        </h2>
        <p>
            Тренировка в групповом зале, осталось 4 тренировки до 30.03.17
        </p>
        <p>
            Тренировка в тренажерном зале с тренером, осталось 1 тренировка до 30.03.17	
        </p>
    </div>

    <div class="row">
        <h2>
            15.03.2017	
        </h2>
        <p>
        Тренировка в тренажерном зале с тренером, осталось 2 тренировки, 1 из которых с тренером до 30.03.17
        </p>
    </div>
    

    <div class="row">
        <h2>
            15.03.2017	
        </h2>
        <p>
            Тренировка в групповом зале, осталось 5 тренировок до 30.03.17	
        </p>
        <p>
            Тренировка в тренажерном зале с тренером, осталось 3 тренировки, 2 из которых с тренером до 30.03.17	
        </p>
    </div>
    
</div>

