<?php

namespace app\controllers;

use Yii;
use yii\filters\AccessControl;
use yii\web\Controller;
use yii\filters\VerbFilter;
use yii\web\ForbiddenHttpException;
use yii\helpers\Url;
use yii\base\ErrorException;

use app\models\LoginForm;
use app\models\ContactForm;
use app\models\SignupForm;
use app\models\Card;
use app\models\User;
use app\models\Training;

class SiteController extends Controller {

    /**
     * @inheritdoc
     */
    public function behaviors() {
        return [
            'verbs' => [
                'class' => VerbFilter::className(),
                'actions' => [
                    'logout' => ['post'],
                ],
            ],
        ];
    }

    /**
     * @inheritdoc
     */
    public function actions() {
        return [
            'error' => [
                'class' => 'yii\web\ErrorAction',
            ],
            'captcha' => [
                'class' => 'yii\captcha\CaptchaAction',
                'fixedVerifyCode' => YII_ENV_TEST ? 'testme' : null,
            ],
        ];
    }

    /**
     * Личный кабинет - Главная.
     *
     * @return string
     */
    public function actionIndex() {
        $user = User::find()->where(['email' => Yii::$app->user->identity->email])->one();
        
        $card = Card::find()->where(['card_id' => $user->card_id])->one();

        if ($card) {
            // check if fields passed are empty
            if ($_POST['name']) {
                $name = $_POST['name'];
                $phone = $_POST['phone'];

                // create email body and send it 
                $to = 'youremail@mail.com'; // put your email
                $email_subject = "Вам отправлена форма - Перезвоните мне: $name";
                $email_body = "Заполнена форма \"Перезвоните мне\". \n\n" .
                        "Данные отправителя:\n\nИмя: $name \n" .
                        "Телефон: $phone";
                $headers = "From: contact@mail.com\n";
                $headers .= "Reply-To:";
                mail($to, $email_subject, $email_body, $headers);
                
                return true;
            }

            return $this->render('index',
                [
                    'card' => $card
                ]
            );
        }
        else 
            return $this->render('no_card');
    }
    
    /**
     * Регистрация
     * 
     * @return type
     */
    public function actionSignup() {
        $model = new SignupForm();

        // если модель загрузилась из $_POST
        if ($model->load(Yii::$app->request->post()))
            // если юзер присвоился
            if ($user = $model->signup())
                // если мы залогинились
                if (Yii::$app->getUser()->login($user))
                    return $this->goHome();

        return $this->render('signup', [
                    'model' => $model,
        ]);
    }

    public function actionSetcards() {
//        ob_start();
//        var_dump($_POST);
//        $output = ob_get_clean();
//        file_put_contents('log.php', $output);
        
        $test = '{"card_id":["7331111004308","7331111003707","7331111004001","7331111004452",'
                . '"7331111001833","7331111005008","7331111003844","7331111003806","7331111004391","7331111004841","7331111004391","7331111004445",'
                . '"7331111003998","7331111003844","7331111004148","7331111001833","7331111003691","7331111004995","7331111004292","7331111003851"],'
                . '"fio":['
                    . '"Булыгин Андрей Сергеевич"'
                    . ',"Егорова Ольга Сергеевна"'
                    . ',"Ушаков Андрей Сергеевич"'
                    . ',"Фокина Мария Вячеславовна"'
                        . ',"Трофимов Андрей Викторович"'
                    . ',"Ефанов Владимир Викторович"'
                    . ',"Витютнев Сергей Владимирович"'
                    . ',"Помыткина Екатерина Эдуардовна"'
                    . ',"Кижаев Андрей Александрович"'
                    . ',"Ахметшина Аделя Фаридовна"'
                    . ',"Кижаев Андрей Александрович"'
                    . ',"Алексеев Владимир Петрович"'
                    . ',"Сидякин Максим Геннадьевич"'
                    . ',"Витютнев Сергей Владимирович"'
                    . ',"Жандаров Игорь Сергеевич"'
                    . ',"Трофимов Андрей Викторович"'
                    . ',"Чигирева Ирина Александровна"'
                    . ',"Ещеркина Наталья Александровна"'
                    . ',"Терентьев Андрей Владимирович"'
                    . ',"Китаев Бек-Хан Асламбекович"'
                . '],"abon_name":["","Попова Елена - йога 12 занятий",'
                . '"","","Групповые занятия 12 посещений","","Групповые занятия 12 посещений","Групповые занятия 12 посещений","Абонемент на свободн'
                . 'ое посещение на год","","Групповые занятия 12 посещений","","Абонемент на'
                . ' свободное посещение на год","Абонемент на свободное посещение на год","","Абонемент на свободное посещение на год","","","",""],"'
                . 'last_operation":["","","","","","","","","","","","","","","","","","","",""],"first_visit_date":["","25.04.2017 8:46:54","","","3'
                . '1.01.2017 8:32:19","","21.02.2017 8:18:07","05.08.2016 7:03:55","17.05.2016 7:46:06","15.04.2016 17:52:19","31.03.2017 23:07:07","'
                . '","15.04.2016 15:36:14","18.04.2016 9:27:47","","18.04.2016 8:49:11","","","",""],"expiration_date":["","25.05.2017 0:00:00","",""'
                . ',"17.04.2017 0:00:00","","06.05.2017 0:00:00","16.04.2017 0:00:00","17.05.2017 0:00:00","01.01.0001 0:00:00","30.03.2017 0:00:00",'
                . '"","30.05.2017 0:00:00","26.04.2018 0:00:00","","19.04.2018 0:00:00","","","",""],"visits_count":["","7","","","-12","","12","12",'
                . '"1 000","5","12","","883","985","","982","","","",""],"gym_ostalos":["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0'
                . '","0","0","0","0"],"gym_vsego":["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"],"group_ostalos":["'
                . '0","0","0","0","12","0","12","12","0","0","12","0","0","0","0","0","0","0","0","0"],"group_vsego":["0","0","0","0","-12","0","12","'
                . '12","0","0","12","0","0","0","0","0","0","0","0","0"],"private_ostalos":["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0'
                . '","0","0","0","0","0"],"private_vsego":["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"],"subzero_d'
                . 'ate":["01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00"'
                . ',"01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.0'
                . '1.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.000'
                . '1 0:00:00","01.01.0001 0:00:00"],"lina_inverse_date":["01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:'
                . '00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00'
                . '","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.'
                . '01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00","01.01.0001 0:00:00"]}';
        $response = json_decode($test, true);
        
        // получаем json из post
//        $response = json_decode($_POST["JSONdata"], true);

        if (!empty($response))
            foreach ($response['card_id'] as $i => $card_id) {
                $card = Card::find()->where(['card_id' => $card_id])->one();
                
//                if ($card_id == '7331111004841') {
//                    $a = 1;
//                }
                
                if ($card)
                    $card->delete();
                
                $card = new Card;
                $card->card_id = $card_id;
                
                $card->fio = $response['fio'][$i];
                $card->last_operation = $response['last_operation'][$i];
                $card->current_subscription = $response['abon_name'][$i];
                $card->subscription_finish = 
                    ($response['expiration_date'][$i] && ($response['expiration_date'][$i] != '01.01.0001 0:00:00'))
                    ? date("Y.m.d", strtotime($response['expiration_date'][$i]))
                    : '';
                
                $card->gym_ostalos = $response['gym_ostalos'][$i];
                $card->gym_vsego = $response['gym_vsego'][$i];
                
                $card->group_ostalos = $response['group_ostalos'][$i];
                $card->group_vsego = $response['group_vsego'][$i];
                
                $card->private_ostalos = $response['private_ostalos'][$i];
                $card->private_vsego = $response['private_vsego'][$i];
                
                $card->freeze_date = $response['subzero_date'][$i] == '01.01.0001 0:00:00'
                    ? ''
                    : $response['subzero_date'][$i];
                
                $card->unfreeze_date = $response['lina_inverse_date'][$i] == '01.01.0001 0:00:00'
                    ? ''
                    : $response['lina_inverse_date'][$i];   
                
                if (!$card->save())
                    throw new ForbiddenHttpException('Данные не сохранены');
            }
            
//            echo $i;
//        return $this->render('showcards');
    }
    
    public function actionSettrainings() {
//        ob_start();
//        var_dump($_POST);
//        $output = ob_get_clean();
//        file_put_contents('log.php', $output);
        $test = '{
            "fio":[
                "Вирясова Дарья Сергеевна",
                "Герасимова Наталья Николаевна",
                "Бихузина Эльвира Фанильевна",
                "Кузьмин Александр Сергеевич",
                "Тигин Никита Евгеньевич",
                "Комолов Артем Русланович",
                "Филиппова Алевтина Александровна",
                "Филиппова Алевтина Александровна",
                "Чердакчеева Юлия Владимировна",
                "Кузьмина Ольга Владимировна",
                "Кантемирова Карина Адисовна",
                "Севастьянов Игорь Николаевич",
                "Свидерская Дарья Андреевна",
                "Шмитько Антонина Игоревна",
                "Искакова Александровна Денисова ",
                "Слепова Дарья Игоревна",
                "Кузнецов Алексей Витальевич",
                "Кормилихин Алексей Вячеславович",
                "Вавилов Роман Сергеевич",
                "Макаров Игорь Николаевич",
                "Чигирева Ирина Александровна",
                "Чигирева Ирина Александровна",
                "Глазков Артем Александрович",
                "Сазонов Сергей Владимирович",
                "Сазонов Сергей Владимирович",
                "Назаров Егор Константинович",
                "Кудинова Светлана Валентиновна",
                "Школьников Владислав Николаевич",
                "Ямкин Никита Генадьевич",
                "Ларочкин Александр Сергеевич",
                "Ларочкин Александр Сергеевич",
                "Еделькин Анатолий Иванович",
                "Кирюхин Евгений Андреевич",
                "Шамшутдинова Руфия Каримовна",
                "Шамшутдинова Руфия Каримовна",
                "Шарабарова Наталья Николаевна",
                "Шарабарова Наталья Николаевна",
                "Каменов Алексей Игорьвич",
                "Баланюк Светолика Александровна",
                "Маслов Александр Николаевич",
                "Каргаолов Олег Борисович",
                "Абраамян Карен Ваникович",
                "Абраамян Карен Ваникович",
                "Трифонов Максим Владимирович",
                "Мелентьев Денис Сергеевич",
                "Мелентьев Денис Сергеевич",
                "Мозговой Павел Андреевич",
                "Саттаров Вадим Расимович",
                "Власова Татьяна Александровна",
                "Пайдутова Кристина Игоревна",
                "Уварова Юлия Игоревна",
                "Уварова Юлия Игоревна",
                "Котлобай Ольга Леонидовна",
                "Белорусов Владимир Николаевич",
                "Федорченко Галина Анатольевна",
                "Федорченко Галина Анатольевна",
                "Капитова Наталья Константиновна",
                "Буркина Диана Андреевна",
                "Акинфин Павел Владимирович",
                "Гордеев Александр Александрович",
                "Яшин Данила Алексеевич",
                "Помыткин Дмитрий Андреевич",
                "Котомкин Семен Алексеевич",
                "Курицына Светлана Валерьевна",
                "Трофимов Андрей Андреевич",
                "Фахриев Марат Фарухович",
                "Катиркин Иван Михайлович Уволен",
                "Лебедева Людмила Алексеевна",
                "Лебедева Людмила Алексеевна",
                "Бирюкова Светлана Васильевна",
                "Сагдеев Руслан Салимжанович",
                "Кадринов Андрей Николаевич",
                "Бирюкова Светлана Васильевна",
                "Куренкова Анна Адреевна",
                "Куренкова Анна Адреевна",
                "Курашов Вадим Александрович",
                "Сорокина Ирина Александровна",
                "Курашова Наталья Ириковна",
                "Иванова Татьяна Витальевна",
                "Трофимов Андрей Викторович",
                "Антонов Егор Михайлович",
                "Пыдин Алексей Николаевич",
                "Мухтаров Рашид Ильшатович",
                "Сурков Данила Юрьевич",
                "Скворцова Евгения Владимировна",
                "Дубровский Руслан Александрович",
                "Скворцова Евгения Владимировна",
                "Дубровский Руслан Александрович",
                "Леонтьев Станислав Сергеевич",
                "Паркин Сергей Владимирович",
                "Никитин Владимир Олегович",
                "Михайлова Мария Михайловна",
                "Кириллов Антон Валентинович",
                "Бухарова Анастасия Сегеевна",
                "Вещина Анастасия Алексеевна",
                "Бухарова Анастасия Сегеевна",
                "Воробьева Наталья Анатольевна",
                "Овчинников Сергей Александрович",
                "Вахрушин Владимир Анатольевич",
                "Держаева Юлия Викторовна"
            ],
            "abon_name":[
                "Кострякова Светлана - Functional training- 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Групповые занятия 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Школьный абонемент 12 посещений на месяц",
                "Школьный абонемент 12 посещений на месяц",
                "Абонемент на свободное посещение на месяц",
                "Групповые занятия 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 8 занятий на месяц",
                "Абонемент на свободное посещение на месяц",
                "Студенческий абонемент на 12 посещений на месяц",
                "Школьный абонемент 12 посещений на месяц",
                "Ирина Агеева - Силовой фитнес - 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 12 занятий на месяц",
                "Пенсионный абонемент на 12 посещений",
                "Групповые занятия 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Школьный абонемент 12 посещений на месяц",
                "Групповые занятия 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Школьный абонемент 8 посещений на месяц",
                "Абонемент на свободное посещение на месяц",
                "Студенческий абонемент на 12 посещений на месяц",
                "Школьный абонемент 12 посещений на месяц",
                "Студенческий абонемент на 12 посещений на месяц",
                "Студенческий абонемент на 12 посещений на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на свободное посещение на год",
                "",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на свободное посещение на год",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 8 занятий на месяц",
                "Павел Чернов - 4 посещения",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Бочков Александр 8 посещений",
                "Абонемент Корпоративный на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Павел Чернов - 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Олипер Денис 8 посещений",
                "Абонемент на свободное посещение на месяц",
                "ДОП абонемент для групповых (безлимитный)",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 8 занятий на месяц",
                "Абонемент на свободное посещение на год",
                "Школьный абонемент 8 посещений на месяц",
                "ДОП абонемент для групповых (безлимитный)",
                "Школьный абонемент 12 посещений на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 12 занятий на месяц",
                "Студенческий абонемент на 12 посещений на месяц",
                "Абонемент АРБАТ на свободное посещение на месяц",
                "Абонемент на 8 занятий на месяц",
                "Олипер Денис 8 посещений",
                "Абонемент на 8 занятий на месяц",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на 12 занятий на месяц",
                "Олипер Денис 8 посещений",
                "Абонемент на 12 занятий на месяц",
                "Агеева Ирина 12 посещений",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на свободное посещение на год",
                "Студенческий абонемент на 12 посещений на месяц",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на свободное посещение на год",
                "Школьный абонемент 12 посещений на месяц",
                "Групповые занятия 12 посещений",
                "Групповые занятия 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на год",
                "Групповые занятия 12 посещений",
                "Павел Чернов - 12 посещений",
                "Абонемент на 12 занятий на месяц",
                "Абонемент на свободное посещение на месяц",
                "Школьный абонемент 12 посещений на месяц",
                "ДОП абонемент для групповых (безлимитный)",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Мельникова Елена - Аэробика -12 занятий",
                "Групповые занятия 12 посещений",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на свободное посещение на месяц",
                "Абонемент на 12 посещений в месяц в дневное время (с 7 до 16-00)",
                "Абонемент на 8 занятий на месяц"
            ],
            "trainer":[
                "Кострякова Светлана",
                "",
                "Кострякова Светлана",
                "",
                "",
                "",
                "",
                "Агеева Ирина",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "Агеева Ирина",
                "",
                "",
                "",
                "",
                "Кострякова Светлана",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "Мариам Чадунели",
                "",
                "",
                "",
                "",
                "",
                "Павел Чернов",
                "",
                "",
                "Бочков Александр",
                "",
                "",
                "",
                "",
                "Павел Чернов",
                "",
                "",
                "",
                "Олипер Денис",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "Олипер Денис",
                "",
                "",
                "",
                "Олипер Денис",
                "",
                "Агеева Ирина",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "Павел Чернов",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "Агеева Ирина",
                "",
                "",
                "",
                ""
            ],
            "vid_zanyatiya":[
                "",
                "",
                "Групповое занятие",
                "",
                "",
                "",
                "",
                "Групповое занятие",
                "",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "",
                "",
                "",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "Групповое занятие",
                "",
                "",
                "Групповое занятие",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "Занятие в тренажерном зале",
                "Занятие в тренажерном зале",
                "",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "",
                "Занятие в тренажерном зале",
                "Занятие с инструктором",
                "",
                "",
                "Занятие с инструктором",
                "Занятие в тренажерном зале",
                "",
                "",
                "",
                "Занятие с инструктором",
                "",
                "",
                "",
                "Занятие с инструктором",
                "",
                "Занятие в тренажерном зале",
                "",
                "Занятие в тренажерном зале",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "Занятие в тренажерном зале",
                "Занятие в тренажерном зале",
                "Занятие с инструктором",
                "Занятие в тренажерном зале",
                "Занятие в тренажерном зале",
                "Занятие в тренажерном зале",
                "Занятие с инструктором",
                "Занятие в тренажерном зале",
                "Занятие с инструктором",
                "Занятие в тренажерном зале",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "",
                "Групповое занятие",
                "Групповое занятие",
                "",
                "",
                "",
                "Групповое занятие",
                "Занятие с инструктором",
                "Занятие в тренажерном зале",
                "",
                "",
                "Занятие в тренажерном зале",
                "",
                "",
                "",
                "Групповое занятие",
                "",
                "",
                "",
                "Занятие в тренажерном зале"
            ],
            "karta":[
                "7331111000591",
                "7331111001543",
                "7331111005435",
                "7331111001567",
                "7331111007286",
                "7331111006524",
                "7331111000928",
                "7331111000928",
                "7331111005152",
                "7331111005138",
                "7331111006388",
                "7331111000898",
                "7331111001369",
                "7331111003974",
                "7331111003837",
                "7331111004070",
                "7331111002427",
                "7331111007187",
                "7331111001703",
                "7331111005213",
                "7331111003691",
                "7331111003691",
                "7331111006739",
                "7331111001468",
                "7331111001468",
                "7331111001123",
                "7331111004865",
                "7331111005626",
                "7331111004131",
                "7331111001192",
                "7331111001192",
                "7331111020490",
                "7331111003479",
                "7331111002090",
                "7331111002090",
                "7331111003257",
                "7331111003257",
                "7331111005091",
                "7331111006869",
                "7331111004490",
                "7331111000713",
                "7331111026577",
                "7331111026577",
                "7331111003783",
                "7331111016912",
                "7331111016912",
                "7331111022050",
                "7331111005527",
                "7331111025822",
                "7331111000560",
                "7331111010743",
                "7331111010743",
                "7331111005336",
                "7331111010804",
                "7331111026911",
                "7331111026911",
                "7331111011726",
                "7331111001895",
                "7331111006920",
                "7331111005534",
                "7331111000812",
                "7331111002021",
                "7331111020384",
                "7331111014697",
                "7331111004513",
                "7331111000546",
                "7331111026867",
                "7331111024498",
                "7331111024498",
                "7331111024580",
                "7331111001147",
                "7331111003349",
                "7331111024580",
                "7331111004421",
                "7331111004421",
                "7331111006111",
                "7331111002335",
                "7331111005718",
                "7331111006180",
                "7331111001833",
                "7331111001031",
                "7331111000362",
                "7331111006685",
                "7331111010569",
                "7331111010576",
                "7331111006562",
                "7331111010576",
                "7331111006562",
                "7331111025686",
                "7331111026348",
                "7331111029967",
                "7331111027352",
                "7331111022517",
                "7331111000386",
                "7331111025303",
                "7331111000386",
                "7331111000102",
                "7331111007262",
                "7331111003103",
                "7331111023866"
            ],
            "date":[
                "06.06.2016 17:45:25",
                "06.06.2016 17:42:52",
                "06.06.2016 17:42:33",
                "06.06.2016 17:42:13",
                "06.06.2016 17:40:59",
                "06.06.2016 17:40:48",
                "06.06.2016 17:40:31",
                "06.06.2016 17:40:31",
                "06.06.2016 17:35:51",
                "06.06.2016 17:34:32",
                "06.06.2016 17:32:54",
                "06.06.2016 17:30:17",
                "06.06.2016 17:30:06",
                "06.06.2016 17:29:53",
                "06.06.2016 17:29:39",
                "06.06.2016 17:25:30",
                "06.06.2016 17:23:14",
                "06.06.2016 17:23:00",
                "06.06.2016 17:21:30",
                "06.06.2016 17:20:19",
                "06.06.2016 17:17:10",
                "06.06.2016 17:17:10",
                "06.06.2016 17:15:40",
                "06.06.2016 17:11:08",
                "06.06.2016 17:11:08",
                "06.06.2016 17:03:01",
                "06.06.2016 17:02:02",
                "06.06.2016 16:56:02",
                "06.06.2016 16:55:53",
                "06.06.2016 16:50:42",
                "06.06.2016 16:50:36",
                "06.06.2016 16:45:45",
                "06.06.2016 16:25:00",
                "06.06.2016 16:11:25",
                "06.06.2016 16:11:19",
                "06.06.2016 16:10:53",
                "06.06.2016 16:10:53",
                "06.06.2016 15:53:25",
                "06.06.2016 15:42:58",
                "06.06.2016 15:35:24",
                "06.06.2016 15:19:15",
                "13.01.2017 9:09:17",
                "13.01.2017 9:09:16",
                "13.01.2017 8:35:10",
                "13.01.2017 8:24:02",
                "13.01.2017 8:24:02",
                "13.01.2017 8:16:00",
                "06.06.2016 14:56:15",
                "13.01.2017 8:15:37",
                "06.06.2016 14:55:26",
                "13.01.2017 8:08:40",
                "13.01.2017 8:08:40",
                "13.01.2017 7:55:31",
                "13.01.2017 7:33:11",
                "13.01.2017 7:33:00",
                "13.01.2017 7:33:00",
                "13.01.2017 7:32:51",
                "06.06.2016 14:53:18",
                "06.06.2016 14:47:39",
                "06.06.2016 14:19:48",
                "06.06.2016 14:09:50",
                "13.01.2017 7:10:45",
                "06.06.2016 14:09:40",
                "13.01.2017 7:08:07",
                "06.06.2016 14:08:15",
                "06.06.2016 13:56:13",
                "13.01.2017 7:01:06",
                "13.01.2017 6:55:06",
                "13.01.2017 6:55:04",
                "13.01.2017 6:54:58",
                "06.06.2016 13:53:35",
                "06.06.2016 13:45:00",
                "13.01.2017 6:54:55",
                "06.06.2016 13:27:50",
                "06.06.2016 13:27:50",
                "06.06.2016 13:26:31",
                "13.01.2017 6:49:36",
                "06.06.2016 13:26:19",
                "06.06.2016 13:25:19",
                "13.01.2017 6:47:53",
                "06.06.2016 13:22:46",
                "13.01.2017 6:47:48",
                "13.01.2017 6:47:48",
                "13.01.2017 6:46:35",
                "13.01.2017 6:46:35",
                "06.06.2016 13:01:46",
                "13.01.2017 6:46:35",
                "06.06.2016 13:01:46",
                "13.01.2017 6:46:34",
                "13.01.2017 6:46:34",
                "13.01.2017 6:46:34",
                "13.01.2017 6:46:34",
                "13.01.2017 6:46:34",
                "06.06.2016 12:58:33",
                "13.01.2017 6:46:34",
                "06.06.2016 12:58:33",
                "13.01.2017 6:46:34",
                "06.06.2016 12:53:47",
                "13.01.2017 6:46:34",
                "13.01.2017 6:46:33"
            ]
            }';
        
        $response = json_decode($test, true);
        
        // получаем json из post
//        $response = json_decode($_POST["JSONdata"], true);

        if (!empty($response))
            foreach ($response['date'] as $i => $uid) {
//                $training = Training::find()->where(['uid' => $uid])->one();
//
//                if ($training)
//                    $training->delete();
                
                $training = new Training;
                $training->card_id = $response['karta'][$i];
                $training->uid = $response['uid'][$i];
                
                $training->title = $response['vid_zanyatiya'][$i];
                $training->coach = $response['trainer'][$i];
                
                $training->date = ($response['date'][$i] == '01.01.0001 0:00:00')
                    ? ''
                    : date("Y.m.d", strtotime($response['date'][$i]));
                
                if (!$training->save());
//                    throw new yii\base\ForbiddenHttpException('Данные не сохранены');
            }
            
//            echo $i;
//        return $this->render('showcards');
    }
    
    public function actionShowcards() {
        return $this->render('showcards');
    }
    
    public function actionShowtrainings() {
        return $this->render('showtrainings');
    }

    /**
     * Displays about page.
     *
     * @return string
     */
    public function actionReport() {
        // если я гость
        if (
            Yii::$app->user->isGuest) {
            // и это не страница /login и не страница showcards
            if (
                (($actionId !== 'login')
                && ($actionId !== 'signup')
                && ($actionId !== 'showcards')
                && ($actionId !== 'setcards'))
            ) {
                return $this->redirect('login');
            }
        }
        
        return $this->render('report');
    }
    
    /**
     * Login action.
     *
     * @return string
     */
    public function actionLogin() {
        if (!Yii::$app->user->isGuest)
            return $this->goHome();

        $model = new LoginForm();
        
        if ($model->load(Yii::$app->request->post()) && $model->login())
            return $this->goBack();
        
        return $this->render('login', [
            'model' => $model,
        ]);
    }

    /**
     * Logout action.
     *
     * @return string
     */
    public function actionLogout() {
        Yii::$app->user->logout();

        return $this->goHome();
    }
    
    public function beforeAction($action) {
        $this->enableCsrfValidation = ($action->id !== "setcards"); 
        
        $actionId = Yii::$app->controller->action->id;
        
        // если я гость
        if (
            Yii::$app->user->isGuest) {
            // и это не страница /login и не страница showcards
            if (
                (($actionId !== 'login')
                && ($actionId !== 'signup')
                && ($actionId !== 'showcards')
                && ($actionId !== 'setcards'))
            ) {
                return $this->redirect('login');
            }
        }
            
        
        return parent::beforeAction($action);
    }
}
